In [1]:
import pandas as pd

In [2]:
pd.read_csv('Desktop/Data.csv')

      NAME  DATE SALARY   COUNTRY
0     samy  2004    15$  mansoura
1   khaled  2005    16$     saudi
2      ali  2006    18$     saudi
3     omar  2007    19$     saudi
4   yasser  2009    13$      iran
5  abobakr  2000    10$     saudi
6    hamza  1999   144$     saudi

In [3]:
data=pd.read_csv('Desktop/Data.csv')

In [4]:
data.head() # print first 5 rows

     NAME  DATE SALARY   COUNTRY
0    samy  2004    15$  mansoura
1  khaled  2005    16$     saudi
2     ali  2006    18$     saudi
3    omar  2007    19$     saudi
4  yasser  2009    13$      iran

In [5]:
data.head(2)  # print first 2 rows

     NAME  DATE SALARY   COUNTRY
0    samy  2004    15$  mansoura
1  khaled  2005    16$     saudi

In [6]:
data.tail() # print last 5 rows

      NAME  DATE SALARY COUNTRY
2      ali  2006    18$   saudi
3     omar  2007    19$   saudi
4   yasser  2009    13$    iran
5  abobakr  2000    10$   saudi
6    hamza  1999   144$   saudi

In [7]:
data.tail(2) # print last 2 rows

      NAME  DATE SALARY COUNTRY
5  abobakr  2000    10$   saudi
6    hamza  1999   144$   saudi

In [8]:
data.shape

(7, 4)

### Data shape
### (7,4) :
### 7 number of rows .
### 4 number of col .

___________________

# Dataframes & Series

In [9]:
type(data)

pandas.core.frame.DataFrame

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   NAME     7 non-null      object
 1   DATE     7 non-null      int64
 2   SALARY   7 non-null      object
 3   COUNTRY  7 non-null      object
dtypes: int64(1), object(3)
memory usage: 352.0+ bytes

In [11]:
data.describe()

              DATE
count     7.000000
mean   2004.285714
std       3.638419
min    1999.000000
25%    2002.000000
50%    2005.000000
75%    2006.500000
max    2009.000000

In [12]:
names=["abdulrahman",'mohammed','abdelrazek']

In [13]:
pd.DataFrame(names)

             0
0  abdulrahman
1     mohammed
2   abdelrazek

In [14]:
pd.DataFrame(names,columns=['Names'])

         Names
0  abdulrahman
1     mohammed
2   abdelrazek

In [15]:
dic={'names':['abdo','abdullah','ahmed'],
     'salary':['152$','130$','500$'],
     'date':['2000','2003','2005']
}

In [16]:
dict=pd.DataFrame(dic)
dict

      names salary  date
0      abdo   152$  2000
1  abdullah   130$  2003
2     ahmed   500$  2005

In [17]:
dict['names']

0        abdo
1    abdullah
2       ahmed
Name: names, dtype: object

In [18]:
type(dict['names'])

pandas.core.series.Series

In [19]:
dict.iloc[1]

names     abdullah
salary        130$
date          2003
Name: 1, dtype: object

In [20]:
dict.iloc[[1,0]] # Swap

      names salary  date
1  abdullah   130$  2003
0      abdo   152$  2000

# Indxes Pandas

In [21]:
index=['one','two','three']

In [22]:
dict.set_index([index],inplace=True)
dict

          names salary  date
one        abdo   152$  2000
two    abdullah   130$  2003
three     ahmed   500$  2005

In [23]:
dict.loc['one']

names     abdo
salary    152$
date      2000
Name: one, dtype: object

# Filtering Data

In [24]:
data

      NAME  DATE SALARY   COUNTRY
0     samy  2004    15$  mansoura
1   khaled  2005    16$     saudi
2      ali  2006    18$     saudi
3     omar  2007    19$     saudi
4   yasser  2009    13$      iran
5  abobakr  2000    10$     saudi
6    hamza  1999   144$     saudi

In [25]:
H=(data['DATE'] > 2005)
H

0    False
1    False
2     True
3     True
4     True
5    False
6    False
Name: DATE, dtype: bool

In [26]:
data.loc[H]

     NAME  DATE SALARY COUNTRY
2     ali  2006    18$   saudi
3    omar  2007    19$   saudi
4  yasser  2009    13$    iran

In [27]:
data.loc[H,['SALARY','COUNTRY']]

  SALARY COUNTRY
2    18$   saudi
3    19$   saudi
4    13$    iran

In [28]:
data

      NAME  DATE SALARY   COUNTRY
0     samy  2004    15$  mansoura
1   khaled  2005    16$     saudi
2      ali  2006    18$     saudi
3     omar  2007    19$     saudi
4   yasser  2009    13$      iran
5  abobakr  2000    10$     saudi
6    hamza  1999   144$     saudi

In [29]:
data['NAME'].unique()

array(['samy', 'khaled', 'ali', 'omar', 'yasser', 'abobakr', 'hamza'],
      dtype=object)

In [30]:
name=['khaled']

In [31]:
filt=data['NAME'].isin(name)

In [32]:
data.loc[filt]

     NAME  DATE SALARY COUNTRY
1  khaled  2005    16$   saudi

# Add & Remove Col

In [33]:
data.drop(columns=['SALARY'],inplace=True)

In [34]:
data

      NAME  DATE   COUNTRY
0     samy  2004  mansoura
1   khaled  2005     saudi
2      ali  2006     saudi
3     omar  2007     saudi
4   yasser  2009      iran
5  abobakr  2000     saudi
6    hamza  1999     saudi

In [35]:
data.drop(index=0)

      NAME  DATE COUNTRY
1   khaled  2005   saudi
2      ali  2006   saudi
3     omar  2007   saudi
4   yasser  2009    iran
5  abobakr  2000   saudi
6    hamza  1999   saudi

In [36]:
new=data['NAME']+" "+ data['COUNTRY']

In [37]:
data['new']=new

In [38]:
data

      NAME  DATE   COUNTRY            new
0     samy  2004  mansoura  samy mansoura
1   khaled  2005     saudi   khaled saudi
2      ali  2006     saudi      ali saudi
3     omar  2007     saudi     omar saudi
4   yasser  2009      iran    yasser iran
5  abobakr  2000     saudi  abobakr saudi
6    hamza  1999     saudi    hamza saudi

# Data Sorting

In [39]:
data.sort_values(by=['DATE','NAME'])

      NAME  DATE   COUNTRY            new
6    hamza  1999     saudi    hamza saudi
5  abobakr  2000     saudi  abobakr saudi
0     samy  2004  mansoura  samy mansoura
1   khaled  2005     saudi   khaled saudi
2      ali  2006     saudi      ali saudi
3     omar  2007     saudi     omar saudi
4   yasser  2009      iran    yasser iran

In [40]:
data.sort_index(ascending=False)

      NAME  DATE   COUNTRY            new
6    hamza  1999     saudi    hamza saudi
5  abobakr  2000     saudi  abobakr saudi
4   yasser  2009      iran    yasser iran
3     omar  2007     saudi     omar saudi
2      ali  2006     saudi      ali saudi
1   khaled  2005     saudi   khaled saudi
0     samy  2004  mansoura  samy mansoura

In [41]:
data['NAME'].sort_values()

5    abobakr
2        ali
6      hamza
1     khaled
3       omar
0       samy
4     yasser
Name: NAME, dtype: object

# UPDATING & ROWS AND COLUMNS

In [42]:
data

      NAME  DATE   COUNTRY            new
0     samy  2004  mansoura  samy mansoura
1   khaled  2005     saudi   khaled saudi
2      ali  2006     saudi      ali saudi
3     omar  2007     saudi     omar saudi
4   yasser  2009      iran    yasser iran
5  abobakr  2000     saudi  abobakr saudi
6    hamza  1999     saudi    hamza saudi

In [43]:
data.columns

Index(['NAME', 'DATE', 'COUNTRY', 'new'], dtype='object')

In [44]:
data.DATE

0    2004
1    2005
2    2006
3    2007
4    2009
5    2000
6    1999
Name: DATE, dtype: int64

In [45]:
data.columns.str.replace(' ','_')

Index(['NAME', 'DATE', 'COUNTRY', 'new'], dtype='object')

In [46]:
data.rename(columns={'DATE':'date'},inplace=True)

In [47]:
data

      NAME  date   COUNTRY            new
0     samy  2004  mansoura  samy mansoura
1   khaled  2005     saudi   khaled saudi
2      ali  2006     saudi      ali saudi
3     omar  2007     saudi     omar saudi
4   yasser  2009      iran    yasser iran
5  abobakr  2000     saudi  abobakr saudi
6    hamza  1999     saudi    hamza saudi

In [48]:
data.loc[1,'date']=2020

In [49]:
data

      NAME  date   COUNTRY            new
0     samy  2004  mansoura  samy mansoura
1   khaled  2020     saudi   khaled saudi
2      ali  2006     saudi      ali saudi
3     omar  2007     saudi     omar saudi
4   yasser  2009      iran    yasser iran
5  abobakr  2000     saudi  abobakr saudi
6    hamza  1999     saudi    hamza saudi

In [50]:
data.at[2,'date']=98989

In [51]:
data

      NAME   date   COUNTRY            new
0     samy   2004  mansoura  samy mansoura
1   khaled   2020     saudi   khaled saudi
2      ali  98989     saudi      ali saudi
3     omar   2007     saudi     omar saudi
4   yasser   2009      iran    yasser iran
5  abobakr   2000     saudi  abobakr saudi
6    hamza   1999     saudi    hamza saudi

# Clean & Save Data

In [52]:
data

      NAME   date   COUNTRY            new
0     samy   2004  mansoura  samy mansoura
1   khaled   2020     saudi   khaled saudi
2      ali  98989     saudi      ali saudi
3     omar   2007     saudi     omar saudi
4   yasser   2009      iran    yasser iran
5  abobakr   2000     saudi  abobakr saudi
6    hamza   1999     saudi    hamza saudi

In [53]:
data.isnull().sum()

NAME       0
date       0
COUNTRY    0
new        0
dtype: int64

In [54]:
data.dropna(inplace=True)

In [55]:
data.isnull().sum()

NAME       0
date       0
COUNTRY    0
new        0
dtype: int64

In [56]:
data.to_csv('Pandas.csv')

In [57]:
open('Pandas.csv')